cmsis-svd/cmsis-svd/data/Renesas/R7FA6T3BB.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="DMAC0">
            <name>DMAC1</name>
            <description>Direct memory access controller 1</description>
            <baseAddress>0x40005040</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC0">
            <name>DMAC2</name>
            <description>Direct memory access controller 2</description>
            <baseAddress>0x40005080</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC0">
            <name>DMAC3</name>
            <description>Direct memory access controller 3</description>
            <baseAddress>0x400050C0</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC0">
            <name>DMAC4</name>
            <description>Direct memory access controller 4</description>
            <baseAddress>0x40005100</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC0">
            <name>DMAC5</name>
            <description>Direct memory access controller 5</description>
            <baseAddress>0x40005140</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC0">
            <name>DMAC6</name>
            <description>Direct memory access controller 6</description>
            <baseAddress>0x40005180</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC0">
            <name>DMAC7</name>
            <description>Direct memory access controller 7</description>
            <baseAddress>0x400051C0</baseAddress>
        </peripheral>
        <peripheral>
            <name>DMA</name>
            <description>DMAC Module Activation</description>
            <baseAddress>0x40005200</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x40</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>DMAST</name>
                    <description>DMA Module Activation Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>DMST</name>
                            <description>DMAC Operation Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>DMAC activation is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>DMAC activation is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMECHR</name>
                    <description>DMAC Error Channel Register</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>DMECH</name>
                            <description>DMAC Error channel</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DMECHSAM</name>
                            <description>DMAC Error channel Security Attribution Monitor</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>secure channel</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>non-secure channel</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DMESTA</name>
                            <description>DMAC Error Status</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No DMA transfer error occurred</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>DMA transfer error occurred</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
